---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetSourceId
source: html/8b7097a5-d1e3-ee12-e899-3b8aade4ed6c.htm
---
# Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer.GetSourceId Method

Reports this server's source ID.

## Syntax (C#)
```csharp
string GetSourceId()
```

## Returns
The source ID.